Revit 2027 API
LightType.SetLossFactor Method
 Replace the current loss factor object with the given object
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLossFactor(
	LossFactor lossFactor
)
Public Sub SetLossFactor (
	lossFactor As LossFactor
)
public:
void SetLossFactor(
	LossFactor^ lossFactor
)
member SetLossFactor :
        lossFactor : LossFactor -> unit
Parameters
lossFactor LossFactor
 An object derived from a LossFactor object
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The argument object is cloned
See Also
Reference
LightType Class
Autodesk.Revit.DB.Lighting Namespace